In [1]:
import pandas as pd

melb_df = pd.read_csv('data/melb_data_fe.csv')
melb_df.head()

,Suburb,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,Bedroom,...,Longtitude,Regionname,Propertycount,MeanRoomsSquare,AreaRatio,MonthSale,AgeBuilding,WeekdaySale,StreetType,Weekend
0,Abbotsford,2,house,1480000.0,S,Biggin,2016-03-12,2.5,3067,2,...,144.9984,Northern Metropolitan,4019,25.20,-0.231707,3,46,5,St,1
1,Abbotsford,2,house,1035000.0,S,Biggin,2016-04-02,2.5,3067,2,...,144.9934,Northern Metropolitan,4019,15.80,-0.327660,4,116,5,St,1
2,Abbotsford,3,house,1465000.0,SP,Biggin,2017-04-03,2.5,3067,3,...,144.9944,Northern Metropolitan,4019,18.75,0.056338,4,117,0,St,0
3,Abbotsford,3,house,850000.0,PI,Biggin,2017-04-03,2.5,3067,3,...,144.9969,Northern Metropolitan,4019,15.75,0.145455,4,47,0,other,0
4,Abbotsford,4,house,1600000.0,VB,Nelson,2016-04-06,2.5,3067,3,...,144.9941,Northern Metropolitan,4019,17.75,0.083969,4,2,2,St,0

In [2]:
import numpy as np

Задание 7.3


Дано две исходных таблицы:

In [3]:
data_1 = pd.DataFrame({'Value': [100, 45, 80],
                       'Group': [1, 4, 5]},
                      index = ['I0', 'I1', 'I2']
                     )
data_1

    Value  Group
I0    100      1
I1     45      4
I2     80      5

In [4]:
data_2 = pd.DataFrame({'Company': ['Google', 'Amazon', 'Facebook'],
                       'Add': ['S0', 'S1', 'S7']},
                      index = ['I0', 'I1', 'I3']
                     )
data_2

     Company Add
I0    Google  S0
I1    Amazon  S1
I3  Facebook  S7

Какой из перечисленных вариантов кода позволяет получить представленный ниже результат?

In [5]:
data_1.join(data_2,
            how='inner'
            )

    Value  Group Company Add
I0    100      1  Google  S0
I1     45      4  Amazon  S1

Задание 7.4

Даны две исходные таблицы:

In [6]:
a = pd.DataFrame({'A': ['a', 'b', 'c'], 'B': [103, 214, 124], 'C': [1, 4, 2]})
b = pd.DataFrame({'V': ['d', 'b', 'c'], 'U': [1393.7, 9382.2, 1904.5], 'C': [1, 3, 2]})
a, b

(   A    B  C
 0  a  103  1
 1  b  214  4
 2  c  124  2,
    V       U  C
 0  d  1393.7  1
 1  b  9382.2  3
 2  c  1904.5  2)

Какой из перечисленных вариантов кода позволяет получить представленный ниже результат?

In [7]:
a.join(b.set_index('C'),
       on='C',
       how='right'
       )# Здесь индексы в формате float (0.0) и индекс 1 = NaN
# or
a.merge(b,
       on='C',
       how='right'
       )

     A      B  C  V       U
0    a  103.0  1  d  1393.7
1  NaN    NaN  3  b  9382.2
2    c  124.0  2  c  1904.5

Задание 7.5

Даны две таблицы: `items_df`, в которой содержится информация о наличии товаров на складе, и `purchase_df` с данными о покупках товаров.

Первая:  
`items_df = pd.DataFrame({
    'item_id': [417283, 849734, 132223, 573943, 19475, 3294095, 382043, 302948, 100132, 312394],
    'vendor': ['Samsung', 'LG', 'Apple', 'Apple', 'LG', 'Apple', 'Samsung', 'Samsung', 'LG', 'ZTE'],
    'stock_count': [54, 33, 122, 18, 102, 43, 77, 143, 60, 19]
})`

Вторая:

`purchase_df = pd.DataFrame({
    'purchase_id': [101, 101, 101, 112, 121, 145, 145, 145, 145, 221],
    'item_id': [417283, 849734, 132223, 573943, 19475, 3294095, 382043, 302948, 103845, 100132],
    'price': [13900, 5330, 38200, 49990, 9890, 33000, 67500, 34500, 89900, 11400]
})`

Информация в таблицах представлена в виде следующих столбцов:

`item_id` — идентификатор модели;
`vendor` — производитель модели;
`stock_count` — имеющееся на складе количество данных моделей (в штуках);
`purchase_id` — идентификатор покупки;
`price` — стоимость модели в покупке.

Вам необходимо сделать следующее:
Сформируйте `DataFrame` `merged`, так чтобы после объединения `purchase_df` и `items_df` остались модели, которые учтены на складе и имели продажи.

На основе таблицы merged найдите суммарную выручку, которую можно было бы получить от продажи всех товаров, имеющихся на складе. Результат занесите в переменную `income`.

In [8]:
items_df = pd.DataFrame({
    'item_id': [417283, 849734, 132223, 573943, 19475, 3294095, 382043, 302948, 100132, 312394],
    'vendor': ['Samsung', 'LG', 'Apple', 'Apple', 'LG', 'Apple', 'Samsung', 'Samsung', 'LG', 'ZTE'],
    'stock_count': [54, 33, 122, 18, 102, 43, 77, 143, 60, 19]
})
purchase_df = pd.DataFrame({
    'purchase_id': [101, 101, 101, 112, 121, 145, 145, 145, 145, 221],
    'item_id': [417283, 849734, 132223, 573943, 19475, 3294095, 382043, 302948, 103845, 100132],
    'price': [13900, 5330, 38200, 49990, 9890, 33000, 67500, 34500, 89900, 11400]
})
merged = items_df.merge(purchase_df,
               how='inner'
               )
merged
income_1 = merged['stock_count']*merged['price']
income = income_1.sum()
income

19729490

Для решения задач нам понадобится выделить из признака `title` год выпуска фильма. Для этого напишем функцию `get_year_release`(`arg`).

In [9]:
#библиотека для регулярных выражений
import re 
def get_year_release(arg):
    #находим все слова по шаблону "(DDDD)"
    candidates = re.findall(r'\(\d{4}\)', arg) 
    # проверяем число вхождений
    if len(candidates) > 0:
        #если число вхождений больше 0,
	#очищаем строку от знаков "(" и ")"
        year = candidates[0].replace('(', '')
        year = year.replace(')', '')
        return int(year)
    else:
        #если год не указан, возвращаем None
        return None


Задание 8.1

Создайте в таблице новый признак `year_release`, который соответствует году выпуска фильма.
У скольких фильмов не указан год их выпуска?

In [10]:
from collections import Counter
from collections import defaultdict

ratings_movies = pd.read_csv('data/movies_data/ratings_movies.csv').copy()

year_release_dict = defaultdict(list)
for i in range(ratings_movies['title'].shape[0]):
    year_release_dict['releas'].append(get_year_release(ratings_movies['title'][i]))

year_release = Counter(year_release_dict['releas'])
year_release[None]

18

In [11]:
# ЗАДАНИЕ 8.1
# joined == ratings_movies
# joined['year_release'] = joined['title'].apply(get_year_release)
# joined.info()

Задание 8.2

Какой фильм, выпущенный в 1999 году, получил наименьшую среднюю оценку зрителей?
В качестве ответа запишите название этого фильма без указания года его выпуска.

In [12]:
release = pd.DataFrame(year_release_dict)
release

        releas
0       1995.0
1       1995.0
2       1995.0
3       1995.0
4       1995.0
...        ...
100831  2017.0
100832  2017.0
100833  2017.0
100834  2017.0
100835  2017.0

[100836 rows x 1 columns]

In [13]:
ratings_movies_r = pd.concat([ratings_movies, release], axis=1)
ratings_movies_r

,Unnamed: 0,userId,movieId,rating,date,title,genres,releas
0,0,1,1,4.0,2000-07-30 18:45:03,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1995.0
1,1,1,3,4.0,2000-07-30 18:20:47,Grumpier Old Men (1995),Comedy|Romance,1995.0
2,2,1,6,4.0,2000-07-30 18:37:04,Heat (1995),Action|Crime|Thriller,1995.0
3,3,1,47,5.0,2000-07-30 19:03:35,Seven (a.k.a. Se7en) (1995),Mystery|Thriller,1995.0
4,4,1,50,5.0,2000-07-30 18:48:51,"Usual Suspects, The (1995)",Crime|Mystery|Thriller,1995.0
...,...,...,...,...,...,...,...,...
100831,100831,610,166534,4.0,2017-05-03 21:53:22,Split (2017),Drama|Horror|Thriller,2017.0
100832,100832,610,168248,5.0,2017-05-03 22:21:31,John Wick: Chapter Two (2017),Action|Crime|Thriller,2017.0
100833,100833,610,168250,5.0,2017-05-08 19:50:47,Get Out (2017),Horror,2017.0
100834,100834,610,168252,5.0,2017-05-03 21:19:12,Logan (2017),Action|Sci-Fi,2017.0
100835,100835,610,170875,3.0,2017-05-03 21:20:15,The Fate of the Furious (2017),Action|Crime|Drama|Thriller,2017.0

In [14]:
ratings_movies_r[ratings_movies_r['releas'] == 1999].groupby('title')['rating'].mean().sort_values()

title
Bloodsport: The Dark Kumite (1999)            0.5
Simon Sez (1999)                              1.0
Chill Factor (1999)                           1.0
Source, The (1999)                            1.0
Trippin' (1999)                               1.0
                                             ...
Trailer Park Boys (1999)                      5.0
Larry David: Curb Your Enthusiasm (1999)      5.0
Sun Alley (Sonnenallee) (1999)                5.0
George Carlin: You Are All Diseased (1999)    5.0
Five Senses, The (1999)                       5.0
Name: rating, Length: 261, dtype: float64

In [15]:
# joined == ratings_movies_r
# mask = joined['year_release'] == 1999
# joined[mask].groupby('title')['rating'].mean().sort_values()

Задание 8.3

Какое сочетание жанров фильмов (`genres`), выпущенных в 2010 году, получило наименьшую среднюю оценку (`rating`)?
Запишите сочетание так же, как оно указано в таблице (через разделитель |, без пробелов).

In [18]:
mark = ratings_movies_r['releas'] == 2010
ratings_movies_r[mark].groupby('genres')['rating'].mean().sort_values()

genres
Action|Sci-Fi                        1.000000
Action|Adventure|Horror              1.500000
Action|Drama|Fantasy                 1.500000
Crime|Romance                        1.500000
Adventure|Comedy|Fantasy             1.833333
                                       ...
Crime                                4.750000
Comedy|Musical                       5.000000
Animation|Drama|Fantasy|Mystery      5.000000
Adventure|Children|Comedy|Mystery    5.000000
Animation|Children|Mystery           5.000000
Name: rating, Length: 119, dtype: float64

Задание 8.4

Какой пользователь (`userId`) посмотрел наибольшее количество различных (уникальных) комбинаций жанров (`genres`) фильмов? В качестве ответа запишите идентификатор этого пользователя.

In [67]:

rrrr = ratings_movies_r.groupby('userId')['genres'].nunique().sort_values()
rrrr.tail(1)

userId
599    524
Name: genres, dtype: int64

Задание 8.5

Найдите пользователя, который выставил наименьшее количество оценок, но его средняя оценка фильмам наибольшая.
В качестве ответа укажите идентификатор этого пользователя.
Чтобы рассчитать несколько параметров для каждого пользователя (количество оценок и среднюю оценку), можно воспользоваться методом `agg()` на сгруппированных данных.

In [78]:
ratings_movies_r.groupby('userId')['rating'].agg(
    ['count', 'mean']).sort_values(
        ['count', 'mean'], ascending=[True, False]).head()

        count   mean
userId
53         20  5.000
595        20  4.200
189        20  4.100
569        20  4.000
278        20  3.875

Задание 8.6

Найдите сочетание жанров (`genres`) за 2018 году, которое имеет наибольший средний рейтинг (среднее по столбцу `rating`), и при этом число выставленных ему оценок (количество значений в столбце `rating`) больше 10.
Запишите сочетание так же, как оно указано в таблице (через разделитель |, без пробелов).

In [109]:
mark = ratings_movies_r['releas'] == 2018
mark_1 = ratings_movies_r[mark].groupby(
    'genres')['rating'].count() > 10
ratings_movies_r[mark].groupby('genres')['rating'].agg(
    ['mean', 'count'])[mark_1].sort_values('mean', ascending=False)

                             mean  count
genres
Action|Adventure|Sci-Fi  3.928571     14
Action|Comedy|Sci-Fi     3.875000     12

In [110]:
# Решение SkillFactory
mask = ratings_movies_r['releas'] == 2018
grouped = ratings_movies_r[mask].groupby('genres')['rating'].agg(
    ['mean', 'count']
)
grouped[grouped['count']>10].sort_values(
    by='mean',
    ascending=False
)

                             mean  count
genres
Action|Adventure|Sci-Fi  3.928571     14
Action|Comedy|Sci-Fi     3.875000     12

Задание 8.7

Добавьте в таблицу новый признак `year_rating` — год выставления оценки. Создайте сводную таблицу, которая иллюстрирует зависимость среднего рейтинга фильма от года выставления оценки и жанра. Выберите верные варианты ответа, исходя из построенной таблицы:

In [122]:
ratings_movies_r['date'] = ratings_movies_r['date'].astype('datetime64[ns]')
year = ratings_movies_r['date'].dt.year
ratings_movies_r['year_rating'] = year
ratings_movies_r.head()

,Unnamed: 0,userId,movieId,rating,date,title,genres,releas,year_rating
0,0,1,1,4.0,2000-07-30 18:45:03,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1995.0,2000
1,1,1,3,4.0,2000-07-30 18:20:47,Grumpier Old Men (1995),Comedy|Romance,1995.0,2000
2,2,1,6,4.0,2000-07-30 18:37:04,Heat (1995),Action|Crime|Thriller,1995.0,2000
3,3,1,47,5.0,2000-07-30 19:03:35,Seven (a.k.a. Se7en) (1995),Mystery|Thriller,1995.0,2000
4,4,1,50,5.0,2000-07-30 18:48:51,"Usual Suspects, The (1995)",Crime|Mystery|Thriller,1995.0,2000

In [130]:
ratings_movies_r.pivot_table(
        values='rating', 
        index='year_rating', 
        columns='genres', 
        aggfunc=['mean']
)

                          mean                             \
genres      (no genres listed)    Action Action|Adventure
year_rating
1996                       NaN  2.730769         3.454545
1997                       NaN  3.538462         4.150000
1998                       NaN       NaN         4.200000
1999                       NaN       NaN         4.000000
2000                       NaN  2.588235         3.738462
2001                       NaN  3.000000         3.500000
2002                       NaN  2.750000         4.304348
2003                       NaN  3.833333         3.277778
2004                       NaN  2.700000         4.136364
2005                       NaN  3.357143         3.413043
2006                       NaN  2.166667         4.090909
2007                       NaN  2.583333         3.666667
2008                       NaN  3.000000         3.656250
2009                       NaN       NaN         3.714286
2010                       NaN  3.500000         3.437500
2011                       NaN  4.500000         3.888889
2012                       NaN  2.625000         3.900000
2013                       NaN  2.500000         3.833333
2014                       NaN       NaN         3.875000
2015                  0.500000  3.100000         3.560976
2016                  3.500000  3.545455         3.722222
2017                  3.000000  2.637931         3.527778
2018                  3.676471  2.588235         3.397436

                                                                            \
genres      Action|Adventure|Animation Action|Adventure|Animation|Children
year_rating
1996                               NaN                                 NaN
1997                               NaN                                 NaN
1998                               NaN                                 NaN
1999                               NaN                                 NaN
2000                               NaN                                 NaN
2001                               NaN                                 NaN
2002                               NaN                                 NaN
2003                               NaN                                 NaN
2004                               NaN                                 NaN
2005                               NaN                                 NaN
2006                               NaN                                 NaN
2007                               NaN                                 NaN
2008                               NaN                                 NaN
2009                               NaN                                 NaN
2010                               NaN                                 NaN
2011                               NaN                                 NaN
2012                               NaN                            4.000000
2013                               NaN                            3.000000
2014                             3.000                            3.500000
2015                             3.800                            3.666667
2016                             3.750                            3.833333
2017                             3.375                            3.500000
2018                             3.650                            3.166667

                                                        \
genres      Action|Adventure|Animation|Children|Comedy
year_rating
1996                                               NaN
1997                                               NaN
1998                                               NaN
1999                                               NaN
2000                                               NaN
2001                                               NaN
2002                                               NaN
2003                                               NaN
2004                                          4.000000
2005                                          4.107143
2006                                          3.833333
2007                                          3.846154
2008                                          4.125000
2009                                          3.900000
2010                                          4.333333
2011                                          3.500000
2012                                          3.785714
2013                                          4.333333
2014                                          3.250000
2015                                          3.565217
2016                                          3.925000
2017                                          3.676471
2018                                          3.741935

                                                                \
genres      Action|Adventure|Animation|Children|Comedy|Fantasy
year_rating
1996                                                       NaN
1997                                                       NaN
1998                                                       NaN
1999                                                       NaN
2000                                                       NaN
2001                                                       NaN
2002                                                       NaN
2003                                                       NaN
2004                                                       NaN
2005                                                       NaN
2006                                                       NaN
2007                                                  3.000000
2008                                                  4.000000
2009                                                       NaN
2010                                                       NaN
2011                                                       NaN
2012                                                       NaN
2013                                                       NaN
2014                                                  3.833333
2015                                                  3.833333
2016                                                  3.388889
2017                                                  3.700000
2018                                                  4.142857

                                                             \
genres      Action|Adventure|Animation|Children|Comedy|IMAX
year_rating
1996                                                    NaN
1997                                                    NaN
1998                                                    NaN
1999                                                    NaN
2000                                                    NaN
2001                                                    NaN
2002                                                    NaN
2003                                                    NaN
2004                                                    NaN
2005                                                    NaN
2006                                                    NaN
2007                                                    NaN
2008                                                    NaN
2009                                               3.250000
2010                                               3.500000
2011                                                    NaN
2012                                               3.550000
2013                                               5.000000
2014                                               3.500000
2015                                               3.375000
2016                                               3.666667
2017                                               1.000000
2018                                               3.700000

                                                                \
genres      Action|Adventure|Animation|Children|Comedy|Romance
year_rating
1996                                                       NaN
1997                                                       NaN
1998                                                       NaN
1999                                                       NaN
2000                                                       NaN
2001                                                       NaN
2002                                                       NaN
2003                                                       NaN
2004                                                       NaN
2005                                                       NaN
2006                                                       NaN
2007                                                       NaN
2008                                                       NaN
2009                                                       NaN
2010                                                  3.000000
2011                                                       NaN
2012                                                  4.000000
2013                                                       NaN
2014                                                  4.000000
2015                                                  2.333333
2016                                                  1.000000
2017                                                  1.000000
2018                                                  2.500000

                                                               ...  \
genres      Action|Adventure|Animation|Children|Comedy|Sci-Fi  ...
year_rating                                                    ...
1996                                                      NaN  ...
1997                                                      NaN  ...
1998                                                      NaN  ...
1999                                                      NaN  ...
2000                                                      NaN  ...
2001                                                      NaN  ...
2002                                                      NaN  ...
2003                                                      NaN  ...
2004                                                      NaN  ...
2005                                                      NaN  ...
2006                                                      3.0  ...
2007                                                      2.8  ...
2008                                                      3.5  ...
2009                                                      2.5  ...
2010                                                      NaN  ...
2011                                                      4.0  ...
2012                                                      NaN  ...
2013                                                      NaN  ...
2014                                                      NaN  ...
2015                                                      2.5  ...
2016                                                      4.0  ...
2017                                                      2.0  ...
2018                                                      4.0  ...

                                                                    \
genres      Romance|Thriller Romance|War Romance|Western    Sci-Fi
year_rating
1996                     NaN         NaN             NaN       NaN
1997                     NaN         NaN             NaN       NaN
1998                     NaN         NaN             NaN       NaN
1999                   2.000         NaN             NaN       NaN
2000                   4.000         NaN             3.0  3.416667
2001                     NaN         NaN             3.0  2.500000
2002                   3.000         NaN             NaN  3.750000
2003                   3.375         2.5             NaN  2.333333
2004                   3.000         3.0             3.5  2.125000
2005                   2.000         NaN             NaN  3.000000
2006                     NaN         NaN             NaN  0.500000
2007                   1.500         NaN             2.5  3.375000
2008                     NaN         NaN             NaN  3.125000
2009                     NaN         NaN             NaN  2.000000
2010                     NaN         NaN             NaN  4.000000
2011                     NaN         NaN             NaN  3.500000
2012                   2.500         NaN             NaN  4.166667
2013                     NaN         NaN             NaN  1.500000
2014                     NaN         NaN             NaN  2.500000
2015                     NaN         NaN             NaN  2.900000
2016                   2.500         NaN             NaN  3.555556
2017                   3.000         NaN             NaN  3.864865
2018                     NaN         NaN             NaN  3.128571

                                                                             \
genres      Sci-Fi|IMAX Sci-Fi|Thriller Sci-Fi|Thriller|IMAX  Thriller  War
year_rating
1996                NaN        2.666667                  NaN  3.838095  NaN
1997                NaN        3.400000                  NaN  3.923077  NaN
1998                NaN             NaN                  NaN  3.800000  NaN
1999                NaN        4.000000                  NaN  3.700000  4.5
2000                NaN        2.142857                  NaN  3.087912  3.0
2001                NaN        2.500000                  NaN  3.477273  3.0
2002                NaN        3.600000                  NaN  3.583333  3.5
2003                NaN        3.142857                  NaN  3.250000  3.0
2004                NaN             NaN                  NaN  3.464286  3.0
2005                NaN        2.750000                  NaN  3.411765  NaN
2006                NaN        4.500000                  NaN  3.735294  NaN
2007                NaN        2.833333                  NaN  3.421875  NaN
2008                NaN        3.000000                  NaN  3.333333  NaN
2009                NaN        4.000000                  NaN  2.964286  4.0
2010                NaN        2.500000                  NaN  2.833333  NaN
2011                NaN        1.833333             4.000000  3.625000  NaN
2012                NaN        3.500000             3.666667  3.083333  NaN
2013                NaN        3.833333             4.000000  3.666667  NaN
2014           5.000000             NaN             4.000000  4.000000  NaN
2015           4.071429        3.764706             4.000000  2.911765  NaN
2016           3.807692        3.916667             3.666667  3.432432  NaN
2017           4.264706        3.750000             2.500000  3.152174  NaN
2018           3.500000        3.562500                  NaN  3.296296  NaN


genres        Western
year_rating
1996         3.117647
1997         3.000000
1998              NaN
1999         4.000000
2000         4.058824
2001         3.111111
2002         3.000000
2003         4.000000
2004         3.800000
2005         4.500000
2006         3.625000
2007         3.000000
2008         4.000000
2009         3.375000
2010         3.666667
2011         4.000000
2012         4.100000
2013         4.000000
2014         4.000000
2015         3.900000
2016         3.958333
2017         2.933333
2018         3.611111

[23 rows x 951 columns]

✍ А теперь поговорим о заказах в интернет-магазине.

Дано два файла:

`orders.csv`, содержащий данные о заказах;  
`products.csv`, содержащий данные о товарах.